## Домашнее творческое задание по дисциплине "Технологии обработки больших данных" (часть 2)

Выполнил: студент группы __ПМ20-4 Кондаков Илья Владимирович__ и студент группы __ПМ20-4 Радайкин Артём Альбертович__ 

Вариант: __50__

__Предметная область__ : Climate Change: Earth Surface Temperature Data

__Источник данных__: https://www.kaggle.com/datasets/berkeleyearth/climate-change-earth-surface-temperature-data

__При решении данных задач не подразумевается использования циклов или генераторов Python в ходе работы с пакетами `numpy`, `pandas` и `dask`, если в задании не сказано обратного. Решения задач, в которых для обработки массивов `numpy`, структур `pandas` или структур `dask` используются явные циклы (без согласования с преподавателем), могут быть признаны некорректными и не засчитаны.__

__В задачах, связанных с пакетом `dask`, явно указано, какой коллекцией вы должны пользоваться при решении задачи. Все операции вычислений должны проводиться  над этой коллекцией и средствами пакета `dask`, если в задании не сказано обратного.__

In [1]:
import pandas as pd
import numpy as np
import dask.array as da
import dask.bag as db
import dask.dataframe as dd
import re
import multiprocessing
import sqlite3
import json

__Задание 1__. Придумайте несколько варианта посчета количества количества городов для каждой из стран (GlobalLandTemperaturesByCity.csv). Замерьте время выполнения этих решений при помощи time и timeit.

In [2]:
df = pd.read_csv('GlobalLandTemperaturesByCity.csv', encoding='UTF-8', parse_dates=['dt'])

In [3]:
df.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [4]:
%%time
df[['Country', 'City']].drop_duplicates().groupby('Country').count()

CPU times: total: 1.66 s
Wall time: 1.69 s

             City
Country
Afghanistan     8
Albania         3
Algeria         5
Angola          6
Argentina      32
...           ...
Venezuela      40
Vietnam        30
Yemen           2
Zambia          8
Zimbabwe        7

[159 rows x 1 columns]

In [5]:
%%timeit
df[['Country', 'City']].drop_duplicates().groupby('Country').count()

1.64 s ± 10.9 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [6]:
%%time

dict_ = {}

def cnt(row):
    global dict_
    country = row['Country']
    city = row['City']
    
    if country in dict_.keys():
        if city not in dict_[country]:
            dict_[country].append(city)
    else:
        dict_[country] = [city]

df[['Country', 'City']].apply(cnt, axis=1) 

for key in dict_.keys():
    dict_[key] = len(dict_[key])
    
pd.DataFrame.from_dict(dict_, orient='index', columns=['City']).sort_index()

CPU times: total: 2min 58s
Wall time: 3min

             City
Afghanistan     8
Albania         3
Algeria         5
Angola          6
Argentina      32
...           ...
Venezuela      40
Vietnam        30
Yemen           2
Zambia          8
Zimbabwe        7

[159 rows x 1 columns]

In [8]:
def cnt(row):
    global dict_
    country = row['Country']
    city = row['City']
    
    if country in dict_.keys():
        if city not in dict_[country]:
            dict_[country].append(city)
    else:
        dict_[country] = [city]

In [9]:
%%timeit

dict_ = {}

df[['Country', 'City']].apply(cnt, axis=1) 

for key in dict_.keys():
    dict_[key] = len(dict_[key])
    
pd.DataFrame.from_dict(dict_, orient='index', columns=['City']).sort_index()

TypeError: argument of type 'int' is not iterable

__Задание 2__. На основе данных из GlobalLandTemperaturesByMajorCity.csv создайте таблицу в БД SQLite. Продемонстрируйте работу функции pd.read_sql_query, выполнив SQL-запрос с группировкой

In [62]:
df_tem_by_majorcity = pd.read_csv('GlobalLandTemperaturesByMajorCity.csv', encoding='UTF-8', parse_dates=['dt'])

In [64]:
df_tem_by_majorcity.head(2)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1849-01-01,26.704,1.435,Abidjan,Côte D'Ivoire,5.63N,3.23W
1,1849-02-01,27.434,1.362,Abidjan,Côte D'Ivoire,5.63N,3.23W

In [65]:
df_tem_by_majorcity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239177 entries, 0 to 239176
Data columns (total 7 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   dt                             239177 non-null  datetime64[ns]
 1   AverageTemperature             228175 non-null  float64
 2   AverageTemperatureUncertainty  228175 non-null  float64
 3   City                           239177 non-null  object
 4   Country                        239177 non-null  object
 5   Latitude                       239177 non-null  object
 6   Longitude                      239177 non-null  object
dtypes: datetime64[ns](1), float64(2), object(4)
memory usage: 12.8+ MB

In [66]:
con = sqlite3.connect("dtz.sqlite")

In [67]:
cur = con.cursor()

In [71]:
df_tem_by_majorcity.to_sql('Temp_majorcity', con=con, if_exists='append', index=False)

239177

In [72]:
cur.execute("SELECT * FROM Temp_majorcity;")
all_results = cur.fetchmany(2)
print(all_results)

[('1849-01-01 00:00:00', 26.704, 1.435, 'Abidjan', "Côte D'Ivoire", '5.63N', '3.23W'), ('1849-02-01 00:00:00', 27.434, 1.362, 'Abidjan', "Côte D'Ivoire", '5.63N', '3.23W')]

In [82]:
query = '''
        SELECT Country, AVG(AverageTemperature) as avg_temp
        FROM Temp_majorcity
        GROUP BY Country
        HAVING avg_temp > 26
        '''
pd.read_sql_query(query, con=con)

          Country   avg_temp
0           Burma  26.735193
1   Côte D'Ivoire  26.163737
2       Indonesia  26.659057
3         Nigeria  26.361323
4     Philippines  26.448334
5    Saudi Arabia  26.427309
6       Singapore  26.523103
7         Somalia  27.151964
8           Sudan  29.081291
9        Thailand  27.164733
10        Vietnam  27.193984

__Задание 3__. Используя multiprocessing.Pool, продемонстрируйте, как можно применить параллельные вычисления для нахождения века с максимальной температурой (GlobalLandTemperaturesByCity.csv).

In [2]:
shape = 8599212
K  = 8
chunk = 8599212 // K

In [5]:
%%file max_temp_with_centure.py

def max_temp_with_centure(df):
    max_temp = df.AverageTemperature.max()
    year = df.loc[df.AverageTemperature.idxmax()]['dt'][:4]
    if year[2:4] == '00':
        centure = int(year[:2])
    else:
        centure = int(year[:2]) + 1
               
    return [centure, max_temp]

Overwriting max_temp_with_centure.py

In [6]:
from max_temp_with_centure import max_temp_with_centure

In [7]:
with multiprocessing.Pool(processes=K) as pool:
    res = pool.map(max_temp_with_centure, [df for df in pd.read_csv('GlobalLandTemperaturesByCity.csv', chunksize=chunk)])
res

[[21, 39.15600000000001],
 [21, 38.049],
 [20, 36.889],
 [21, 38.531],
 [21, 39.15600000000001],
 [21, 37.859],
 [21, 37.938],
 [18, 39.651],
 [21, 18.775]]

In [8]:
max(res, key=lambda x: x[1])

[18, 39.651]

__Задание 4__. Используя dask.array (GlobalLandTemperaturesByCity.csv), соберите статистику по столбцу AverageTemperature с учетом неопределенности из столбца AverageTemperatureUncertainty

In [11]:
df_gl_by_city = pd.read_csv('GlobalLandTemperaturesByCity.csv', parse_dates = ['dt'])
df_gl_by_city.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [14]:
da_avg_temp = da.from_array(df_gl_by_city[['AverageTemperature', 'AverageTemperatureUncertainty']].values)
da_avg_temp

dask.array<array, shape=(8599212, 2), dtype=float64, chunksize=(8388608, 2), chunktype=numpy.ndarray>

In [17]:
da_avg_temp[:5, 0].compute()

array([6.068,   nan,   nan,   nan,   nan])

In [23]:
da_avg_temp[:, 0].compute()

array([ 6.068,    nan,    nan, ..., 18.775, 18.025,    nan])

In [34]:
import dask
dask.__version__

'2022.12.0'

In [59]:
res_of_conf_interval = da_avg_temp[(-da_avg_temp[:, 1] < da_avg_temp[:, 0]) & ( da_avg_temp[:, 0] < da_avg_temp[:, 1])][:, 0]

In [62]:
mean = res_of_conf_interval.mean()
max_ = res_of_conf_interval.max()
min_ = res_of_conf_interval.min()
std = res_of_conf_interval.std()

In [63]:
da.compute(mean, max_, min_, std)

(1.88870670810785, 15.396, -11.636, 2.725413768849465)

__Задание 5__. Используя dask.bag, найдите максимальное значение средней температуры на каждый год (GlobalLandTemperaturesByCity.csv) при помощи foldby

In [67]:
df_gl_temp = pd.read_csv('GlobalLandTemperaturesByCity.csv')

In [65]:
db.read_text('GlobalLandTemperaturesByCity.csv').take(5)

('dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude\n',
 '1743-11-01,6.068,1.7369999999999999,Århus,Denmark,57.05N,10.33E\n',
 '1743-12-01,,,Århus,Denmark,57.05N,10.33E\n',
 '1744-01-01,,,Århus,Denmark,57.05N,10.33E\n',
 '1744-02-01,,,Århus,Denmark,57.05N,10.33E\n')

In [122]:
df1 = df_gl_temp[['dt', 'AverageTemperature']].dropna().to_dict(orient='records')

In [123]:
with open('GlobalLandTemperaturesByCity.json', 'w') as outfile:
    for row in df1:
        outfile.write(str(row).replace("'", '"') + '\n')

In [124]:
bag = db.read_text('GlobalLandTemperaturesByCity.json').map(json.loads)

({'dt': '1743-11-01', 'AverageTemperature': 6.068},
 {'dt': '1744-04-01', 'AverageTemperature': 5.787999999999999},
 {'dt': '1744-05-01', 'AverageTemperature': 10.644},
 {'dt': '1744-06-01', 'AverageTemperature': 14.050999999999998},
 {'dt': '1744-07-01', 'AverageTemperature': 16.082})

In [125]:
def binop(l, r):
    if l:
        return max((l, r), key=lambda x: x['AverageTemperature'])
    return r

bag.foldby(lambda p: p['dt'][:4], binop).compute()

[('1743', {'dt': '1743-11-01', 'AverageTemperature': 18.722}),
 ('1744', {'dt': '1744-07-01', 'AverageTemperature': 27.496}),
 ('1745', {'dt': '1745-04-01', 'AverageTemperature': 21.63}),
 ('1750', {'dt': '1750-07-01', 'AverageTemperature': 29.613000000000003}),
 ('1751', {'dt': '1751-07-01', 'AverageTemperature': 28.611}),
 ('1752', {'dt': '1752-10-01', 'AverageTemperature': 22.244}),
 ('1753', {'dt': '1753-07-01', 'AverageTemperature': 36.397}),
 ('1754', {'dt': '1754-07-01', 'AverageTemperature': 35.626}),
 ('1755', {'dt': '1755-07-01', 'AverageTemperature': 35.36799999999999}),
 ('1756', {'dt': '1756-07-01', 'AverageTemperature': 34.864000000000004}),
 ('1757', {'dt': '1757-07-01', 'AverageTemperature': 38.414}),
 ('1758', {'dt': '1758-07-01', 'AverageTemperature': 34.392}),
 ('1759', {'dt': '1759-08-01', 'AverageTemperature': 34.898}),
 ('1760', {'dt': '1760-08-01', 'AverageTemperature': 34.431999999999995}),
 ('1761', {'dt': '1761-07-01', 'AverageTemperature': 39.651}),
 ('1762', {'dt': '1762-07-01', 'AverageTemperature': 36.617}),
 ('1763', {'dt': '1763-07-01', 'AverageTemperature': 36.812}),
 ('1764', {'dt': '1764-07-01', 'AverageTemperature': 33.326}),
 ('1765', {'dt': '1765-07-01', 'AverageTemperature': 33.944}),
 ('1766', {'dt': '1766-08-01', 'AverageTemperature': 34.991}),
 ('1767', {'dt': '1767-07-01', 'AverageTemperature': 35.103}),
 ('1768', {'dt': '1768-07-01', 'AverageTemperature': 34.992}),
 ('1769', {'dt': '1769-07-01', 'AverageTemperature': 35.29}),
 ('1770', {'dt': '1770-08-01', 'AverageTemperature': 32.982}),
 ('1771', {'dt': '1771-08-01', 'AverageTemperature': 35.774}),
 ('1772', {'dt': '1772-07-01', 'AverageTemperature': 35.914}),
 ('1773', {'dt': '1773-07-01', 'AverageTemperature': 34.611}),
 ('1774', {'dt': '1774-07-01', 'AverageTemperature': 37.074}),
 ('1775', {'dt': '1775-07-01', 'AverageTemperature': 35.526}),
 ('1776', {'dt': '1776-08-01', 'AverageTemperature': 35.408}),
 ('1777', {'dt': '1777-08-01', 'AverageTemperature': 33.781}),
 ('1778', {'dt': '1778-07-01', 'AverageTemperature': 35.822}),
 ('1779', {'dt': '1779-07-01', 'AverageTemperature': 34.15}),
 ('1780', {'dt': '1780-07-01', 'AverageTemperature': 36.591}),
 ('1781', {'dt': '1781-07-01', 'AverageTemperature': 35.641}),
 ('1782', {'dt': '1782-08-01', 'AverageTemperature': 36.481}),
 ('1783', {'dt': '1783-07-01', 'AverageTemperature': 34.317}),
 ('1784', {'dt': '1784-07-01', 'AverageTemperature': 36.445}),
 ('1785', {'dt': '1785-07-01', 'AverageTemperature': 35.599000000000004}),
 ('1786', {'dt': '1786-07-01', 'AverageTemperature': 36.065}),
 ('1787', {'dt': '1787-08-01', 'AverageTemperature': 34.686}),
 ('1788', {'dt': '1788-07-01', 'AverageTemperature': 37.745}),
 ('1789', {'dt': '1789-07-01', 'AverageTemperature': 35.174}),
 ('1790', {'dt': '1790-08-01', 'AverageTemperature': 34.96}),
 ('1791', {'dt': '1791-08-01', 'AverageTemperature': 34.831}),
 ('1792', {'dt': '1792-07-01', 'AverageTemperature': 34.753}),
 ('1793', {'dt': '1793-07-01', 'AverageTemperature': 35.059999999999995}),
 ('1794', {'dt': '1794-08-01', 'AverageTemperature': 33.924}),
 ('1795', {'dt': '1795-07-01', 'AverageTemperature': 35.085}),
 ('1796', {'dt': '1796-06-01', 'AverageTemperature': 35.777}),
 ('1797', {'dt': '1797-06-01', 'AverageTemperature': 35.88800000000001}),
 ('1798', {'dt': '1798-07-01', 'AverageTemperature': 35.952}),
 ('1799', {'dt': '1799-06-01', 'AverageTemperature': 36.06800000000001}),
 ('1800', {'dt': '1800-07-01', 'AverageTemperature': 35.651}),
 ('1801', {'dt': '1801-07-01', 'AverageTemperature': 35.969}),
 ('1802', {'dt': '1802-06-01', 'AverageTemperature': 36.51300000000001}),
 ('1803', {'dt': '1803-07-01', 'AverageTemperature': 35.753}),
 ('1804', {'dt': '1804-07-01', 'AverageTemperature': 36.574}),
 ('1805', {'dt': '1805-06-01', 'AverageTemperature': 36.01300000000001}),
 ('1806', {'dt': '1806-07-01', 'AverageTemperature': 35.495}),
 ('1807', {'dt': '1807-06-01', 'AverageTemperature': 35.48800000000001}),
 ('1808', {'dt': '1808-07-01', 'AverageTemperature': 35.944}),
 ('1809', {'dt': '1809-07-01', 'AverageTemperature': 34.233999999999995}),
 ('1810', {'dt': '1810-08-01', 'AverageTemperature': 33.052}),
 ('1811', {'dt': '1811-07-01', 'AverageTemperature': 33.542}),
 ('1812', {'dt': '1812-08-01', 'AverageTemperature': 34.586}),
 ('1813', {'dt': '1813-05-01', 'AverageTemperature': 35.741}),
 ('1814', {'dt': '1814-06-01', 'AverageTemperature': 34.979000000000006}),
 ('1815', {'dt': '1815-07-01', 'AverageTemperature': 34.555}),
 ('1816', {'dt': '1816-06-01', 'AverageTemperature': 34.829}),
 ('1817', {'dt': '1817-06-01', 'AverageTemperature': 34.120999999999995}),
 ('1818', {'dt': '1818-06-01', 'AverageTemperature': 36.693000000000005}),
 ('1819', {'dt': '1819-06-01', 'AverageTemperature': 35.33}),
 ('1820', {'dt': '1820-06-01', 'AverageTemperature': 35.822}),
 ('1821', {'dt': '1821-06-01', 'AverageTemperature': 35.457}),
 ('1822', {'dt': '1822-06-01', 'AverageTemperature': 35.751}),
 ('1823', {'dt': '1823-06-01', 'AverageTemperature': 36.695}),
 ('1824', {'dt': '1824-07-01', 'AverageTemperature': 35.49599999999999}),
 ('1825', {'dt': '1825-06-01', 'AverageTemperature': 35.45200000000001}),
 ('1826', {'dt': '1826-05-01', 'AverageTemperature': 35.638000000000005}),
 ('1827', {'dt': '1827-07-01', 'AverageTemperature': 35.792}),
 ('1828', {'dt': '1828-06-01', 'AverageTemperature': 35.871}),
 ('1829', {'dt': '1829-07-01', 'AverageTemperature': 35.47}),
 ('1830', {'dt': '1830-07-01', 'AverageTemperature': 36.639}),
 ('1831', {'dt': '1831-06-01', 'AverageTemperature': 35.188}),
 ('1832', {'dt': '1832-07-01', 'AverageTemperature': 35.973}),
 ('1833', {'dt': '1833-06-01', 'AverageTemperature': 35.913000000000004}),
 ('1834', {'dt': '1834-06-01', 'AverageTemperature': 35.462}),
 ('1835', {'dt': '1835-06-01', 'AverageTemperature': 34.741}),
 ('1836', {'dt': '1836-07-01', 'AverageTemperature': 36.088}),
 ('1837', {'dt': '1837-07-01', 'AverageTemperature': 35.70200000000001}),
 ('1838', {'dt': '1838-07-01', 'AverageTemperature': 36.173}),
 ('1839', {'dt': '1839-07-01', 'AverageTemperature': 36.55}),
 ('1840', {'dt': '1840-07-01', 'AverageTemperature': 37.982000000000006}),
 ('1841', {'dt': '1841-07-01', 'AverageTemperature': 37.07700000000001}),
 ('1842', {'dt': '1842-07-01', 'AverageTemperature': 36.13}),
 ('1843', {'dt': '1843-07-01', 'AverageTemperature': 36.317}),
 ('1844', {'dt': '1844-07-01', 'AverageTemperature': 36.785}),
 ('1845', {'dt': '1845-07-01', 'AverageTemperature': 36.306}),
 ('1846', {'dt': '1846-07-01', 'AverageTemperature': 36.811}),
 ('1847', {'dt': '1847-07-01', 'AverageTemperature': 37.57100000000001}),
 ('1848', {'dt': '1848-07-01', 'AverageTemperature': 36.483}),
 ('1849', {'dt': '1849-07-01', 'AverageTemperature': 36.338}),
 ('1850', {'dt': '1850-07-01', 'AverageTemperature': 36.96100000000001}),
 ('1851', {'dt': '1851-07-01', 'AverageTemperature': 36.746}),
 ('1852', {'dt': '1852-07-01', 'AverageTemperature': 36.527}),
 ('1853', {'dt': '1853-07-01', 'AverageTemperature': 36.57}),
 ('1854', {'dt': '1854-07-01', 'AverageTemperature': 35.578}),
 ('1855', {'dt': '1855-07-01', 'AverageTemperature': 36.277}),
 ('1856', {'dt': '1856-07-01', 'AverageTemperature': 36.622}),
 ('1857', {'dt': '1857-07-01', 'AverageTemperature': 35.81200000000001}),
 ('1858', {'dt': '1858-07-01', 'AverageTemperature': 36.86900000000001}),
 ('1859', {'dt': '1859-07-01', 'AverageTemperature': 36.051}),
 ('1860', {'dt': '1860-07-01', 'AverageTemperature': 37.624}),
 ('1861', {'dt': '1861-07-01', 'AverageTemperature': 36.41}),
 ('1862', {'dt': '1862-07-01', 'AverageTemperature': 36.36300000000001}),
 ('1863', {'dt': '1863-07-01', 'AverageTemperature': 36.67}),
 ('1864', {'dt': '1864-07-01', 'AverageTemperature': 36.259}),
 ('1865', {'dt': '1865-07-01', 'AverageTemperature': 36.32100000000001}),
 ('1866', {'dt': '1866-07-01', 'AverageTemperature': 36.608}),
 ('1867', {'dt': '1867-07-01', 'AverageTemperature': 35.79600000000001}),
 ('1868', {'dt': '1868-07-01', 'AverageTemperature': 36.688}),
 ('1869', {'dt': '1869-08-01', 'AverageTemperature': 36.63500000000001}),
 ('1870', {'dt': '1870-06-01', 'AverageTemperature': 36.427}),
 ('1871', {'dt': '1871-06-01', 'AverageTemperature': 35.91099999999999}),
 ('1872', {'dt': '1872-07-01', 'AverageTemperature': 36.661}),
 ('1873', {'dt': '1873-06-01', 'AverageTemperature': 36.111}),
 ('1874', {'dt': '1874-06-01', 'AverageTemperature': 36.00199999999999}),
 ('1875', {'dt': '1875-06-01', 'AverageTemperature': 37.498000000000005}),
 ('1876', {'dt': '1876-07-01', 'AverageTemperature': 36.45200000000001}),
 ('1877', {'dt': '1877-07-01', 'AverageTemperature': 36.878}),
 ('1878', {'dt': '1878-07-01', 'AverageTemperature': 37.78100000000001}),
 ('1879', {'dt': '1879-07-01', 'AverageTemperature': 36.911}),
 ('1880', {'dt': '1880-07-01', 'AverageTemperature': 36.064}),
 ('1881', {'dt': '1881-07-01', 'AverageTemperature': 36.48800000000001}),
 ('1882', {'dt': '1882-08-01', 'AverageTemperature': 36.329}),
 ('1883', {'dt': '1883-07-01', 'AverageTemperature': 36.89100000000001}),
 ('1884', {'dt': '1884-06-01', 'AverageTemperature': 35.781}),
 ('1885', {'dt': '1885-07-01', 'AverageTemperature': 36.435}),
 ('1886', {'dt': '1886-07-01', 'AverageTemperature': 36.74400000000001}),
 ('1887', {'dt': '1887-06-01', 'AverageTemperature': 36.043}),
 ('1888', {'dt': '1888-07-01', 'AverageTemperature': 36.117}),
 ('1889', {'dt': '1889-06-01', 'AverageTemperature': 36.819}),
 ('1890', {'dt': '1890-06-01', 'AverageTemperature': 36.477}),
 ('1891', {'dt': '1891-07-01', 'AverageTemperature': 36.189}),
 ('1892', {'dt': '1892-07-01', 'AverageTemperature': 36.338}),
 ('1893', {'dt': '1893-07-01', 'AverageTemperature': 36.228}),
 ('1894', {'dt': '1894-06-01', 'AverageTemperature': 35.885}),
 ('1895', {'dt': '1895-06-01', 'AverageTemperature': 36.322}),
 ('1896', {'dt': '1896-06-01', 'AverageTemperature': 36.953}),
 ('1897', {'dt': '1897-06-01', 'AverageTemperature': 36.302}),
 ('1898', {'dt': '1898-06-01', 'AverageTemperature': 36.89}),
 ('1899', {'dt': '1899-07-01', 'AverageTemperature': 37.261}),
 ('1900', {'dt': '1900-06-01', 'AverageTemperature': 37.004}),
 ('1901', {'dt': '1901-07-01', 'AverageTemperature': 37.201}),
 ('1902', {'dt': '1902-08-01', 'AverageTemperature': 36.825}),
 ('1903', {'dt': '1903-08-01', 'AverageTemperature': 37.328}),
 ('1904', {'dt': '1904-07-01', 'AverageTemperature': 36.51900000000001}),
 ('1905', {'dt': '1905-05-01', 'AverageTemperature': 36.565}),
 ('1906', {'dt': '1906-05-01', 'AverageTemperature': 36.761}),
 ('1907', {'dt': '1907-07-01', 'AverageTemperature': 36.151}),
 ('1908', {'dt': '1908-07-01', 'AverageTemperature': 36.473000000000006}),
 ('1909', {'dt': '1909-07-01', 'AverageTemperature': 36.71400000000001}),
 ('1910', {'dt': '1910-07-01', 'AverageTemperature': 36.884}),
 ('1911', {'dt': '1911-06-01', 'AverageTemperature': 36.589}),
 ('1912', {'dt': '1912-06-01', 'AverageTemperature': 36.898}),
 ('1913', {'dt': '1913-06-01', 'AverageTemperature': 36.526}),
 ('1914', {'dt': '1914-06-01', 'AverageTemperature': 36.711}),
 ('1915', {'dt': '1915-06-01', 'AverageTemperature': 37.389}),
 ('1916', {'dt': '1916-07-01', 'AverageTemperature': 36.313}),
 ('1917', {'dt': '1917-07-01', 'AverageTemperature': 37.90300000000001}),
 ('1918', {'dt': '1918-07-01', 'AverageTemperature': 36.195}),
 ('1919', {'dt': '1919-06-01', 'AverageTemperature': 37.372}),
 ('1920', {'dt': '1920-07-01', 'AverageTemperature': 35.98000000000001}),
 ('1921', {'dt': '1921-07-01', 'AverageTemperature': 38.38200000000001}),
 ('1922', {'dt': '1922-07-01', 'AverageTemperature': 37.226000000000006}),
 ('1923', {'dt': '1923-06-01', 'AverageTemperature': 36.726}),
 ('1924', {'dt': '1924-07-01', 'AverageTemperature': 37.021}),
 ('1925', {'dt': '1925-06-01', 'AverageTemperature': 36.392}),
 ('1926', {'dt': '1926-06-01', 'AverageTemperature': 36.511}),
 ('1927', {'dt': '1927-07-01', 'AverageTemperature': 36.704}),
 ('1928', {'dt': '1928-07-01', 'AverageTemperature': 36.737}),
 ('1929', {'dt': '1929-06-01', 'AverageTemperature': 36.748000000000005}),
 ('1930', {'dt': '1930-08-01', 'AverageTemperature': 36.532}),
 ('1931', {'dt': '1931-07-01', 'AverageTemperature': 37.201}),
 ('1932', {'dt': '1932-06-01', 'AverageTemperature': 36.034}),
 ('1933', {'dt': '1933-06-01', 'AverageTemperature': 36.472}),
 ('1934', {'dt': '1934-06-01', 'AverageTemperature': 36.185}),
 ('1935', {'dt': '1935-08-01', 'AverageTemperature': 36.70200000000001}),
 ('1936', {'dt': '1936-08-01', 'AverageTemperature': 36.984}),
 ('1937', {'dt': '1937-07-01', 'AverageTemperature': 37.204}),
 ('1938', {'dt': '1938-07-01', 'AverageTemperature': 37.596}),
 ('1939', {'dt': '1939-06-01', 'AverageTemperature': 36.136}),
 ('1940', {'dt': '1940-08-01', 'AverageTemperature': 36.582}),
 ('1941', {'dt': '1941-06-01', 'AverageTemperature': 36.83}),
 ('1942', {'dt': '1942-06-01', 'AverageTemperature': 36.532}),
 ('1943', {'dt': '1943-08-01', 'AverageTemperature': 36.756}),
 ('1944', {'dt': '1944-07-01', 'AverageTemperature': 36.86900000000001}),
 ('1945', {'dt': '1945-07-01', 'AverageTemperature': 36.538}),
 ('1946', {'dt': '1946-06-01', 'AverageTemperature': 37.34}),
 ('1947', {'dt': '1947-07-01', 'AverageTemperature': 37.22000000000001}),
 ('1948', {'dt': '1948-07-01', 'AverageTemperature': 36.90300000000001}),
 ('1949', {'dt': '1949-05-01', 'AverageTemperature': 36.809}),
 ('1950', {'dt': '1950-07-01', 'AverageTemperature': 36.32700000000001}),
 ('1951', {'dt': '1951-07-01', 'AverageTemperature': 36.973000000000006}),
 ('1952', {'dt': '1952-06-01', 'AverageTemperature': 36.998000000000005}),
 ('1953', {'dt': '1953-06-01', 'AverageTemperature': 36.788}),
 ('1954', {'dt': '1954-06-01', 'AverageTemperature': 36.89}),
 ('1955', {'dt': '1955-07-01', 'AverageTemperature': 36.834}),
 ('1956', {'dt': '1956-05-01', 'AverageTemperature': 36.444}),
 ('1957', {'dt': '1957-07-01', 'AverageTemperature': 36.152}),
 ('1958', {'dt': '1958-06-01', 'AverageTemperature': 36.743}),
 ('1959', {'dt': '1959-06-01', 'AverageTemperature': 36.605}),
 ('1960', {'dt': '1960-07-01', 'AverageTemperature': 37.032}),
 ('1961', {'dt': '1961-07-01', 'AverageTemperature': 37.159000000000006}),
 ('1962', {'dt': '1962-07-01', 'AverageTemperature': 37.36900000000001}),
 ('1963', {'dt': '1963-07-01', 'AverageTemperature': 37.114}),
 ('1964', {'dt': '1964-07-01', 'AverageTemperature': 36.777}),
 ('1965', {'dt': '1965-08-01', 'AverageTemperature': 36.678}),
 ('1966', {'dt': '1966-08-01', 'AverageTemperature': 36.285}),
 ('1967', {'dt': '1967-07-01', 'AverageTemperature': 36.74}),
 ('1968', {'dt': '1968-06-01', 'AverageTemperature': 36.783}),
 ('1969', {'dt': '1969-06-01', 'AverageTemperature': 36.7}),
 ('1970', {'dt': '1970-06-01', 'AverageTemperature': 36.572}),
 ('1971', {'dt': '1971-06-01', 'AverageTemperature': 36.54}),
 ('1972', {'dt': '1972-06-01', 'AverageTemperature': 36.699}),
 ('1973', {'dt': '1973-06-01', 'AverageTemperature': 37.329}),
 ('1974', {'dt': '1974-07-01', 'AverageTemperature': 36.16}),
 ('1975', {'dt': '1975-07-01', 'AverageTemperature': 37.118}),
 ('1976', {'dt': '1976-07-01', 'AverageTemperature': 35.99200000000001}),
 ('1977', {'dt': '1977-07-01', 'AverageTemperature': 36.93000000000001}),
 ('1978', {'dt': '1978-06-01', 'AverageTemperature': 36.862}),
 ('1979', {'dt': '1979-06-01', 'AverageTemperature': 37.345}),
 ('1980', {'dt': '1980-07-01', 'AverageTemperature': 37.823}),
 ('1981', {'dt': '1981-06-01', 'AverageTemperature': 36.916}),
 ('1982', {'dt': '1982-06-01', 'AverageTemperature': 36.419}),
 ('1983', {'dt': '1983-07-01', 'AverageTemperature': 37.49500000000001}),
 ('1984', {'dt': '1984-07-01', 'AverageTemperature': 37.131}),
 ('1985', {'dt': '1985-07-01', 'AverageTemperature': 36.797}),
 ('1986', {'dt': '1986-07-01', 'AverageTemperature': 37.50700000000001}),
 ('1987', {'dt': '1987-07-01', 'AverageTemperature': 37.142}),
 ('1988', {'dt': '1988-06-01', 'AverageTemperature': 37.235}),
 ('1989', {'dt': '1989-07-01', 'AverageTemperature': 38.08600000000001}),
 ('1990', {'dt': '1990-07-01', 'AverageTemperature': 38.103}),
 ('1991', {'dt': '1991-06-01', 'AverageTemperature': 37.187}),
 ('1992', {'dt': '1992-06-01', 'AverageTemperature': 37.569}),
 ('1993', {'dt': '1993-07-01', 'AverageTemperature': 37.176}),
 ('1994', {'dt': '1994-06-01', 'AverageTemperature': 37.39}),
 ('1995', {'dt': '1995-06-01', 'AverageTemperature': 37.52200000000001}),
 ('1996', {'dt': '1996-07-01', 'AverageTemperature': 38.43700000000001}),
 ('1997', {'dt': '1997-07-01', 'AverageTemperature': 37.21100000000001}),
 ('1998', {'dt': '1998-08-01', 'AverageTemperature': 38.537000000000006}),
 ('1999', {'dt': '1999-08-01', 'AverageTemperature': 38.389}),
 ('2000', {'dt': '2000-07-01', 'AverageTemperature': 38.899}),
 ('2001', {'dt': '2001-07-01', 'AverageTemperature': 38.63}),
 ('2002', {'dt': '2002-07-01', 'AverageTemperature': 38.274}),
 ('2003', {'dt': '2003-07-01', 'AverageTemperature': 38.38}),
 ('2004', {'dt': '2004-07-01', 'AverageTemperature': 37.826}),
 ('2005', {'dt': '2005-07-01', 'AverageTemperature': 38.563}),
 ('2006', {'dt': '2006-08-01', 'AverageTemperature': 38.585}),
 ('2007', {'dt': '2007-07-01', 'AverageTemperature': 37.90600000000001}),
 ('2008', {'dt': '2008-07-01', 'AverageTemperature': 38.17400000000001}),
 ('2009', {'dt': '2009-07-01', 'AverageTemperature': 38.14}),
 ('2010', {'dt': '2010-07-01', 'AverageTemperature': 38.96400000000001}),
 ('2011', {'dt': '2011-07-01', 'AverageTemperature': 38.793000000000006}),
 ('2012', {'dt': '2012-07-01', 'AverageTemperature': 39.15300000000001}),
 ('2013', {'dt': '2013-07-01', 'AverageTemperature': 39.15600000000001})]

__Задание 6__. Используя dask.dataFrame (GlobalLandTemperaturesByCity.csм), найдите координаты самой северо-восточной точки из датасета

In [7]:
df_gl_temp = pd.read_csv('GlobalLandTemperaturesByCity.csv', parse_dates=['dt'])

In [6]:
df_gl_temp.head()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [8]:
df_gl_temp.Latitude.apply(lambda x: x[-1]).value_counts()

N    7323138
S    1276074
Name: Latitude, dtype: int64

In [9]:
df_gl_temp.Longitude.apply(lambda x: x[-1]).value_counts()

E    6100003
W    2499209
Name: Longitude, dtype: int64

In [43]:
# нужны макс NE сумма
df = dd.read_csv("GlobalLandTemperaturesByCity.csv",
                 parse_dates=['dt'],
                 assume_missing=True)

In [44]:
coords = df[['Latitude', 'Longitude']].drop_duplicates()

In [32]:
coords.head(5)

      Latitude Longitude
0       57.05N    10.33E
3239    40.99N    27.69E
6478    40.99N    34.08E
9607    50.63N    82.39E
11925   44.20N    87.20E

In [45]:
df.loc[coords.apply(lambda x: float(x.Latitude[:-1]) + float(x.Longitude[:-1]) \
         if (x.Latitude[-1] == 'N') and (x.Longitude[-1] == 'E') else 0, 
         axis=1,  
         meta=('sum_of_coords', 'float')).idxmax()].compute()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
437503,1980-05-01,22.562,0.489,Asgabat,Turkmenistan,37.78N,58.98E
437503,1895-04-01,4.910,0.474,Chernihiv,Ukraine,52.24N,31.53E
437503,2005-07-01,17.551,0.290,Glazov,Russia,58.66N,52.31E
437503,1853-01-01,0.464,1.860,Kashan,Iran,34.56N,50.59E
437503,1880-07-01,26.308,0.619,Melaka,Malaysia,2.41N,102.05E
437503,1839-08-01,12.157,1.811,Petropavlovsk Kamchatskiy,Russia,53.84N,159.55E
437503,1910-09-01,24.633,0.851,Shaki,Nigeria,8.84N,4.05E
437503,1791-12-01,-0.405,2.475,Vanadzor,Armenia,40.99N,44.73E

In [51]:
coords.loc[coords.apply(lambda x: float(x.Latitude[:-1]) + float(x.Longitude[:-1]) \
         if (x.Latitude[-1] == 'N') and (x.Longitude[-1] == 'E') else 0, 
         axis=1,  
         meta=('sum_of_coords', 'float')).idxmax()].compute()

       Latitude Longitude
437503   53.84N   159.55E

In [50]:
df.loc[437503].compute()

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
437503,1980-05-01,22.562,0.489,Asgabat,Turkmenistan,37.78N,58.98E
437503,1895-04-01,4.910,0.474,Chernihiv,Ukraine,52.24N,31.53E
437503,2005-07-01,17.551,0.290,Glazov,Russia,58.66N,52.31E
437503,1853-01-01,0.464,1.860,Kashan,Iran,34.56N,50.59E
437503,1880-07-01,26.308,0.619,Melaka,Malaysia,2.41N,102.05E
437503,1839-08-01,12.157,1.811,Petropavlovsk Kamchatskiy,Russia,53.84N,159.55E
437503,1910-09-01,24.633,0.851,Shaki,Nigeria,8.84N,4.05E
437503,1791-12-01,-0.405,2.475,Vanadzor,Armenia,40.99N,44.73E